================================================================================
String interpolation with comma
================================================================================

_ = "[\{concat $ intersperse ", " $ forget $ bimap show show xs}]"

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (string
        (interpolation
          (exp_name
            (loname))
          (operator)
          (exp_name
            (loname))
          (string)
          (operator)
          (exp_name
            (loname))
          (operator)
          (exp_name
            (loname))
          (exp_name
            (loname))
          (exp_name
            (loname))
          (exp_name
            (loname)))))))

================================================================================
String interpolation with semicolon
================================================================================

_ = "`[\{joinBy "; " (assert_total $ map show xs)}]"

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (string
        (interpolation
          (exp_name
            (loname))
          (string)
          (exp_parens
            (exp_name
              (loname))
            (operator)
            (exp_name
              (loname))
            (exp_name
              (loname))
            (exp_name
              (loname))))))))

================================================================================
Raw strings 1
================================================================================

_ = #"%transform "\{show nm}" \{show s} = \{show t}"#

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (raw_string))))

================================================================================
Raw strings 2
================================================================================

_ = parseRegex #"\\{"#

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (exp_name
        (loname))
      (raw_string))))

================================================================================
Raw strings 3
================================================================================

_ = ##"markdown titles look like this: \##n"# Title \##n body""##

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (raw_string))))

================================================================================
Raw strings 4
================================================================================

_ = ####"kdown titles \#{3} body""####

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (raw_string
        (interpolation
          (literal
            (integer)))))))
