================================================================================
Primitive Types 1
================================================================================

x : Int
x = 94

--------------------------------------------------------------------------------

(idris
  (signature
    (variable)
    (type_name))
  (function
    (variable)
    (exp_literal
      (integer))))

================================================================================
Primitive Types 2
================================================================================

foo : String
foo = "Sausage machine"

--------------------------------------------------------------------------------

(idris
  (signature
    (variable)
    (type_name))
  (function
    (variable)
    (exp_literal
      (string))))

================================================================================
Primitive Types 3
================================================================================

bar : Char
bar = 'Z'

--------------------------------------------------------------------------------

(idris
  (signature
    (variable)
    (type_name))
  (function
    (variable)
    (exp_literal
      (char))))

================================================================================
Primitive Types 4
================================================================================

quux : Bool
quux = False

--------------------------------------------------------------------------------

(idris
  (signature
    (variable)
    (type_name))
  (function
    (variable)
    (exp_name
      (constructor))))
