================================================================================
Primitive Types 1
================================================================================

x : Int
x = 94

--------------------------------------------------------------------------------

(idris
  (signature
    (loname)
    (type_name
      (caname)))
  (function
    (lhs
      (funvar
        (loname)))
    (rhs
      (exp_literal
        (integer)))))

================================================================================
Primitive Types 2
================================================================================

foo : String
foo = "Sausage machine"

--------------------------------------------------------------------------------

(idris
  (signature
    (loname)
    (type_name
      (caname)))
  (function
    (lhs
      (funvar
        (loname)))
    (rhs
      (exp_literal
        (string)))))

================================================================================
Primitive Types 3
================================================================================

bar : Char
bar = 'Z'

--------------------------------------------------------------------------------

(idris
  (signature
    (loname)
    (type_name
      (caname)))
  (function
    (lhs
      (funvar
        (loname)))
    (rhs
      (exp_literal
        (char)))))

================================================================================
Primitive Types 4
================================================================================

quux : Bool
quux = False

--------------------------------------------------------------------------------

(idris
  (signature
    (loname)
    (type_name
      (caname)))
  (function
    (lhs
      (funvar
        (loname)))
    (rhs
      (exp_name
        (caname)))))
