================================================================================
Primitive Types 1
================================================================================

x : Int
x = 94

--------------------------------------------------------------------------------

(source_file
  (function
    (lhs
      (function_name
        (atom
          (qid))))
    (rhs
      (expr
        (atom
          (qid)))))
  (function
    (lhs
      (atom
        (qid)))
    (rhs
      (expr
        (atom
          (qid))))))

================================================================================
Primitive Types 2
================================================================================

foo : String
foo = "Sausage machine"

--------------------------------------------------------------------------------

(source_file
  (function
    (lhs
      (function_name
        (atom
          (qid))))
    (rhs
      (expr
        (atom
          (qid)))))
  (function
    (lhs
      (atom
        (qid)))
    (rhs
      (expr
        (atom
          (literal))))))

================================================================================
Primitive Types 3
================================================================================

bar : Char
bar = 'Z'

--------------------------------------------------------------------------------

(source_file
  (function
    (lhs
      (function_name
        (atom
          (qid))))
    (rhs
      (expr
        (atom
          (qid)))))
  (function
    (lhs
      (atom
        (qid)))
    (rhs
      (expr
        (atom
          (literal))))))

================================================================================
Primitive Types 4
================================================================================

quux : Bool
quux = False

--------------------------------------------------------------------------------

(source_file
  (function
    (lhs
      (function_name
        (atom
          (qid))))
    (rhs
      (expr
        (atom
          (qid)))))
  (function
    (lhs
      (atom
        (qid)))
    (rhs
      (expr
        (atom
          (qid))))))
