================================================================================
Oneline comments
================================================================================

-- Comment

--------------------------------------------------------------------------------

(idris
  (comment)
  (empty_file))

================================================================================
Oneline comments consequtive
================================================================================

-- Comment 1
-- Comment 2

--------------------------------------------------------------------------------

(idris
  (comment)
  (comment)
  (empty_file))

================================================================================
Oneline comments after decl
================================================================================

x : a -- Comment

--------------------------------------------------------------------------------

(idris
  (signature
    (loname)
    (type_name
      (loname)))
  (comment))

================================================================================
Multilie comments
================================================================================

{- This is a comment -}

--------------------------------------------------------------------------------

(idris
  (comment)
  (empty_file))

================================================================================
Multilie comments expanding
================================================================================

{- This is a comment 
Line1
Line2

Line3
-}

--------------------------------------------------------------------------------

(idris
  (comment)
  (empty_file))

================================================================================
Multilie comments in decl
================================================================================

x : a {- comment 1 -} -> a {- comment 2 -} -> a

--------------------------------------------------------------------------------

(idris
  (signature
    (loname)
    (type_name
      (loname))
    (comment)
    (type_name
      (loname))
    (comment)
    (type_name
      (loname))))

================================================================================
Inline documentation
================================================================================

||| Documentation
||| 
||| Something to be documented is here.

--------------------------------------------------------------------------------

(idris
  (comment)
  (comment)
  (comment)
  (empty_file))
