================================================================================
Pragma default
================================================================================

%default total

--------------------------------------------------------------------------------

(idris
  (pragma
    (pragma_name)
    (pragma_arg)))

================================================================================
Pragma inline
================================================================================

%inline -- %unsafe

--------------------------------------------------------------------------------

(idris
  (pragma
    (pragma_name))
  (comment))

================================================================================
Pragma pair
================================================================================

%pair Pair fst snd

--------------------------------------------------------------------------------

(idris
  (pragma
    (pragma_name)
    (pragma_arg)
    (pragma_arg)
    (pragma_arg)))

================================================================================
Pragma name
================================================================================

%name Equal prf

--------------------------------------------------------------------------------

(idris
  (pragma
    (pragma_name)
    (pragma_arg)
    (pragma_arg)))
