================================================================================
String comment like 1
================================================================================

_ = "--"

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (string))))

================================================================================
String comment like 2
================================================================================

_ = "|||"

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (string))))

================================================================================
String interpolation with comma
================================================================================

_ = "[\{concat $ intersperse ", " $ forget $ bimap show show xs}]"

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (string
        (interpolation
          (exp_name
            (loname))
          (operator)
          (exp_name
            (loname))
          (string)
          (operator)
          (exp_name
            (loname))
          (operator)
          (exp_name
            (loname))
          (exp_name
            (loname))
          (exp_name
            (loname))
          (exp_name
            (loname)))))))

================================================================================
String interpolation with semicolon
================================================================================

_ = "`[\{joinBy "; " (assert_total $ map show xs)}]"

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (string
        (interpolation
          (exp_name
            (loname))
          (string)
          (exp_parens
            (exp_name
              (loname))
            (operator)
            (exp_name
              (loname))
            (exp_name
              (loname))
            (exp_name
              (loname))))))))

================================================================================
Raw strings 1
================================================================================

_ = #"%transform "\{show nm}" \{show s} = \{show t}"#

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (raw_string))))

================================================================================
Raw strings 2
================================================================================

_ = parseRegex #"\\{"#

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (exp_name
        (loname))
      (raw_string))))

================================================================================
Raw strings 3
================================================================================

_ = ##"markdown titles look like this: \##n"# Title \##n body""##

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (raw_string))))

================================================================================
Raw strings 4
================================================================================

_ = ####"kdown titles \#{3} body""####

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (raw_string
        (interpolation
          (literal
            (integer)))))))

================================================================================
Triple quote strings - empty
================================================================================

_ = """"""

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (triple_quote_string))))

================================================================================
Triple quote strings - with text and interpolation
================================================================================

_ = """Value is \{x + 1} here"""

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (triple_quote_string
        (interpolation
          (exp_name
            (loname))
          (operator)
          (literal
            (integer)))))))

================================================================================
Triple quote strings - with interpolation and comma inside
================================================================================

_ = """[\{concat $ intersperse ", " $ forget $ bimap show show xs}]"""

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (triple_quote_string
        (interpolation
          (exp_name
            (loname))
          (operator)
          (exp_name
            (loname))
          (string)
          (operator)
          (exp_name
            (loname))
          (operator)
          (exp_name
            (loname))
          (exp_name
            (loname))
          (exp_name
            (loname))
          (exp_name
            (loname)))))))

================================================================================
Triple quote strings - Contains "quotes" inside
================================================================================

_ = """Contains "quotes" inside"""

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (triple_quote_string))))

================================================================================
Triple quote strings - Contains ""double quotes"" inside
================================================================================

_ = """Contains ""double quotes"" inside"""

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (triple_quote_string))))

================================================================================
Triple quote strings multiline - empty
================================================================================

_ = """

"""

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (triple_quote_string))))

================================================================================
Triple quote strings - with text and interpolation
================================================================================

_ = """

Value is \{x + 1} here

"""

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (triple_quote_string
        (interpolation
          (exp_name
            (loname))
          (operator)
          (literal
            (integer)))))))

================================================================================
Triple quote strings - with interpolation and comma inside
================================================================================

_ = """

[\{concat $ intersperse ", " $ forget $ bimap show show xs}]

"""

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (triple_quote_string
        (interpolation
          (exp_name
            (loname))
          (operator)
          (exp_name
            (loname))
          (string)
          (operator)
          (exp_name
            (loname))
          (operator)
          (exp_name
            (loname))
          (exp_name
            (loname))
          (exp_name
            (loname))
          (exp_name
            (loname)))))))

================================================================================
Triple quote strings - Contains "quotes" inside
================================================================================

_ = """

Contains "quotes" inside

"""

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (triple_quote_string))))

================================================================================
Triple quote strings - Contains ""double quotes"" inside
================================================================================

_ = """

Contains ""double quotes"" inside

"""

--------------------------------------------------------------------------------

(idris
  (function
    (lhs
      (wildcard))
    (rhs
      (triple_quote_string))))
